# #算数运算符
print("10+4=",10+4)
print("10-4=",10-4)
print("10*4=",10*4)
print("10/4=",10/4)
print("10//4=",10//4)
print("10%4=",10%4)
print("10**4=",10**4)
#
# #算数运算符的优先级   **＞* / // %＞+ -
print("0.1+10/4**2=",0.1+10/4**2) #10/16=0.625

#小练习 要求输入两个数x与y,分别输出x+y和x-y
x=int(input("请输入x的值:")) #注意input接收的值是字符串类型,所以需要用int类型转换
y=int(input("请输入y的值:"))
print("x+y=",x+y)
print("x-y=",x-y)

#赋值运算符
num=85
num+=10
print("num +=10后,num的值是:",num)  #95

num-=10
print("num -=10后,num的值是:",num) #85

num*=10
print("num *=10后,num的值是:",num) #850

num/=10
print("num /=10后,num的值是:",num)  #85.0

num//=10
print("num //=10后,num的值是:",num) #8.0

num%=3
print("num %=3后,num的值是:",num) #2.0

num**=3
print("num **=3后,num的值是:",num) #8.0

#比较运算符
print("100=100吗",100==100)
print("'100'='100'吗",'100'=='100')
print("100!=100吗",100!=100)
print("100<100吗",100<100)
print("100>100吗",100>100)
print("100>=100吗",100>=100)
print("100<=100吗",100<=100)

#逻辑运算符  and(同时为真,才为真)  or(一边为真,即为真)  not(取反)
#练习1 键盘输入一个数,判断这个数是否在10到20之间
n=int(input("请输入一个数:"))
print(f"{n}在10-20之间",n>=10 and n <=20)

#练习2 键盘输入一个数,判断这个数是否在10到20之外
n=int(input("请输入一个数:"))
print(f"{n}在10和20之外",n <=10 or n >=20)